WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <name>SFIFOCTL</name>
                    <description>I2C Slave FIFO Control</description>
                    <addressOffset>0x126C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SFIFOCTL_TXTRIG</name>
                            <description>TX FIFO Trigger
Indicates at what fill level in the TX FIFO a trigger will be generated.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SFIFOCTL_TXTRIG_LEVEL_4</name>
                                    <description>LEVEL_4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_TXTRIG_LEVEL_5</name>
                                    <description>LEVEL_5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_TXTRIG_LEVEL_6</name>
                                    <description>LEVEL_6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_TXTRIG_LEVEL_7</name>
                                    <description>LEVEL_7</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFIFOCTL_TXFLUSH</name>
                            <description>TX FIFO Flush
Setting this bit will Flush the TX FIFO.
Before reseting this bit to stop Flush the TXFIFOCNT should be checked to be 8 and indicating that the Flush has completed.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SFIFOCTL_TXFLUSH_NOFLUSH</name>
                                    <description>NOFLUSH</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_TXFLUSH_FLUSH</name>
                                    <description>FLUSH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFIFOCTL_RXFLUSH</name>
                            <description>RX FIFO Flush
Setting this bit will Flush the RX FIFO.
Before reseting this bit to stop Flush the RXFIFOCNT should be checked to be 0 and indicating that the Flush has completed.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SFIFOCTL_RXFLUSH_NOFLUSH</name>
                                    <description>NOFLUSH</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_RXFLUSH_FLUSH</name>
                                    <description>FLUSH</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFIFOCTL_RXTRIG</name>
                            <description>RX FIFO Trigger
Indicates at what fill level in the RX FIFO a trigger will be generated.
Note: Programming RXTRIG to 0x0 has no effect since no data is
present to transfer out of RX FIFO.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SFIFOCTL_RXTRIG_LEVEL_5</name>
                                    <description>LEVEL_5</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_RXTRIG_LEVEL_6</name>
                                    <description>LEVEL_6</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_RXTRIG_LEVEL_7</name>
                                    <description>LEVEL_7</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOCTL_RXTRIG_LEVEL_8</name>
                                    <description>LEVEL_8</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFIFOSR</name>
                    <description>I2C Slave FIFO Status Register</description>
                    <addressOffset>0x1270</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000800</resetValue>
                    <fields>
                        <field>
                            <name>SFIFOSR_RXFIFOCNT</name>
                            <description>Number of Bytes which could be read from the RX FIFO</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SFIFOSR_TXFIFOCNT</name>
                            <description>Number of Bytes which could be put into the TX FIFO</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SFIFOSR_TXFLUSH</name>
                            <description>TX FIFO Flush
When this bit is set a Flush operation for the TX FIFO is active. Clear the TXFLUSH bit in the control register to stop.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SFIFOSR_TXFLUSH_INACTIVE</name>
                                    <description>INACTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOSR_TXFLUSH_ACTIVE</name>
                                    <description>ACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFIFOSR_RXFLUSH</name>
                            <description>RX FIFO Flush
When this bit is set a Flush operation for the RX FIFO is active. Clear the RXFLUSH bit in the control register to stop.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SFIFOSR_RXFLUSH_INACTIVE</name>
                                    <description>INACTIVE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SFIFOSR_RXFLUSH_ACTIVE</name>
                                    <description>ACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SLAVE_PECCTL</name>
                    <description>I2C Slave PEC control register</description>
                    <addressOffset>0x1274</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SLAVE_PECCTL_PECCNT</name>
                            <description>When this field is non zero, the number of I2C data bytes are counted. When the byte count = PECCNT and the state machine is transmitting, the contents of the LSFR is loaded into the shift register instead of the byte received from the Tx FIFO. When the state machine is receiving, after the last bit of this byte is received the LSFR is checked and if it is non-zero, a PEC RX Error interrupt is generated. The I2C packet must be padded to include the PEC byte for both transmit and receive. In transmit mode the FIFO must be loaded with a dummy PEC byte. In receive mode the PEC byte will be passed to the Rx FIFO.

