WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
            <register>
                    <name>DOUT3_0</name>
                    <description>Data output 3 to 0</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOUT3_0_DIO0</name>
                            <description>This bit sets the value of the pin configured as DIO0 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO0_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO0_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT3_0_DIO1</name>
                            <description>This bit sets the value of the pin configured as DIO1 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO1_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO1_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT3_0_DIO2</name>
                            <description>This bit sets the value of the pin configured as DIO2 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO2_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO2_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT3_0_DIO3</name>
                            <description>This bit sets the value of the pin configured as DIO3 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO3_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT3_0_DIO3_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOUT7_4</name>
                    <description>Data output 7 to 4</description>
                    <addressOffset>0x1204</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOUT7_4_DIO4</name>
                            <description>This bit sets the value of the pin configured as DIO4 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO4_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO4_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT7_4_DIO5</name>
                            <description>This bit sets the value of the pin configured as DIO5 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO5_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO5_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT7_4_DIO6</name>
                            <description>This bit sets the value of the pin configured as DIO6 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO6_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO6_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT7_4_DIO7</name>
                            <description>This bit sets the value of the pin configured as DIO7 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO7_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT7_4_DIO7_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOUT11_8</name>
                    <description>Data output 11 to 8</description>
                    <addressOffset>0x1208</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOUT11_8_DIO8</name>
                            <description>This bit sets the value of the pin configured as DIO8 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO8_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO8_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT11_8_DIO9</name>
                            <description>This bit sets the value of the pin configured as DIO9 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO9_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO9_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT11_8_DIO10</name>
                            <description>This bit sets the value of the pin configured as DIO10 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO10_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO10_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT11_8_DIO11</name>
                            <description>This bit sets the value of the pin configured as DIO11 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO11_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT11_8_DIO11_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOUT15_12</name>
                    <description>Data output 15 to 12</description>
                    <addressOffset>0x120C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOUT15_12_DIO12</name>
                            <description>This bit sets the value of the pin configured as DIO12 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO12_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO12_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT15_12_DIO13</name>
                            <description>This bit sets the value of the pin configured as DIO13 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO13_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO13_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT15_12_DIO14</name>
                            <description>This bit sets the value of the pin configured as DIO14 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO14_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO14_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOUT15_12_DIO15</name>
                            <description>This bit sets the value of the pin configured as DIO15 when the output is enabled through DOE31_0 register.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO15_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOUT15_12_DIO15_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
