WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                                    <name>DOE31_0_DIO22_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO22_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO23</name>
                            <description>Enables data output for DIO23.</description>
                            <bitOffset>0x17</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO23_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO23_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO24</name>
                            <description>Enables data output for DIO24.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO24_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO24_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO25</name>
                            <description>Enables data output for DIO25.</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO25_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO25_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO26</name>
                            <description>Enables data output for DIO26.</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO26_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO26_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO27</name>
                            <description>Enables data output for DIO27.</description>
                            <bitOffset>0x1B</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO27_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO27_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO28</name>
                            <description>Enables data output for DIO28.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO28_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO28_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO29</name>
                            <description>Enables data output for DIO29.</description>
                            <bitOffset>0x1D</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO29_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO29_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO30</name>
                            <description>Enables data output for DIO30.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO30_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO30_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DOE31_0_DIO31</name>
                            <description>Enables data output for DIO31.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO31_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DOE31_0_DIO31_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
