WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <name>DIN11_8</name>
                    <description>Data input 11 to 8</description>
                    <addressOffset>0x1308</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN11_8_DIO8</name>
                            <description>This bit reads the data input value of DIO8.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO8_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO8_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN11_8_DIO9</name>
                            <description>This bit reads the data input value of DIO9.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO9_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO9_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN11_8_DIO10</name>
                            <description>This bit reads the data input value of DIO10.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO10_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO10_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN11_8_DIO11</name>
                            <description>This bit reads the data input value of DIO11.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO11_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN11_8_DIO11_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIN15_12</name>
                    <description>Data input 15 to 12</description>
                    <addressOffset>0x130C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN15_12_DIO12</name>
                            <description>This bit reads the data input value of DIO12.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO12_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO12_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN15_12_DIO13</name>
                            <description>This bit reads the data input value of DIO13.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO13_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO13_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN15_12_DIO14</name>
                            <description>This bit reads the data input value of DIO14.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO14_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO14_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN15_12_DIO15</name>
                            <description>This bit reads the data input value of DIO15.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO15_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN15_12_DIO15_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIN19_16</name>
                    <description>Data input 19 to 16</description>
                    <addressOffset>0x1310</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN19_16_DIO16</name>
                            <description>This bit reads the data input value of DIO16.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO16_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO16_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN19_16_DIO17</name>
                            <description>This bit reads the data input value of DIO17.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO17_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO17_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN19_16_DIO18</name>
                            <description>This bit reads the data input value of DIO18.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO18_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO18_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN19_16_DIO19</name>
                            <description>This bit reads the data input value of DIO19.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO19_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN19_16_DIO19_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIN23_20</name>
                    <description>Data input 23 to 20</description>
                    <addressOffset>0x1314</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN23_20_DIO20</name>
                            <description>This bit reads the data input value of DIO20.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO20_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO20_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN23_20_DIO21</name>
                            <description>This bit reads the data input value of DIO21.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO21_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO21_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN23_20_DIO22</name>
                            <description>This bit reads the data input value of DIO22.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO22_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO22_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN23_20_DIO23</name>
                            <description>This bit reads the data input value of DIO23.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO23_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN23_20_DIO23_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIN27_24</name>
                    <description>Data input 27 to 24</description>
                    <addressOffset>0x1318</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN27_24_DIO24</name>
                            <description>This bit reads the data input value of DIO24.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO24_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO24_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN27_24_DIO25</name>
                            <description>This bit reads the data input value of DIO25.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO25_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO25_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN27_24_DIO26</name>
                            <description>This bit reads the data input value of DIO26.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO26_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO26_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DIN27_24_DIO27</name>
                            <description>This bit reads the data input value of DIO27.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO27_ZERO</name>
                                    <description>ZERO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIN27_24_DIO27_ONE</name>
                                    <description>ONE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
