WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO28</name>
                            <description>Enables and configures edge detection polarity for DIO28.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO28_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO28_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO28_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO28_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO29</name>
                            <description>Enables and configures edge detection polarity for DIO29.</description>
                            <bitOffset>0x1A</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO29_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO29_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO29_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO29_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO30</name>
                            <description>Enables and configures edge detection polarity for DIO30.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO30_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO30_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO30_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO30_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>POLARITY31_16_DIO31</name>
                            <description>Enables and configures edge detection polarity for DIO31.</description>
                            <bitOffset>0x1E</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO31_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO31_RISE</name>
                                    <description>RISE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO31_FALL</name>
                                    <description>FALL</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POLARITY31_16_DIO31_RISE_FALL</name>
                                    <description>RISE_FALL</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL</name>
                    <description>FAST WAKE GLOBAL EN</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTL_FASTWAKEONLY</name>
                            <description>FASTWAKEONLY for the global control of fastwake</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL_FASTWAKEONLY_NOT_GLOBAL_EN</name>
                                    <description>NOT_GLOBAL_EN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL_FASTWAKEONLY_GLOBAL_EN</name>
                                    <description>GLOBAL_EN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
