WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <name>IMASK</name>
                    <description>Interrupt mask</description>
                    <addressOffset>0x1028</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>IMASK_Z</name>
                            <description>Zero Event mask</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_Z_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_Z_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMASK_L</name>
                            <description>Load Event mask</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_L_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_L_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMASK_CCD0</name>
                            <description>Capture or Compare DN event mask CCP0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_CCD0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_CCD0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMASK_CCD1</name>
                            <description>Capture or Compare DN event mask CCP1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_CCD1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_CCD1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMASK_CCU0</name>
                            <description>Capture or Compare UP event mask CCP0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_CCU0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_CCU0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMASK_CCU1</name>
                            <description>Capture or Compare UP event mask CCP1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_CCU1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_CCU1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IMASK_TOV</name>
                            <description>Trigger Overflow Event mask</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IMASK_TOV_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>IMASK_TOV_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIS</name>
                    <description>Raw interrupt status</description>
                    <addressOffset>0x1030</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>RIS_Z</name>
                            <description>Zero event generated an interrupt.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_Z_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_Z_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIS_L</name>
                            <description>Load event generated an interrupt.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_L_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_L_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIS_CCD0</name>
                            <description>Capture or compare down event generated an interrupt CCP0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_CCD0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_CCD0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIS_CCD1</name>
                            <description>Capture or compare down event generated an interrupt CCP1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_CCD1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_CCD1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIS_CCU0</name>
                            <description>Capture or compare up event generated an interrupt CCP0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_CCU0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_CCU0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIS_CCU1</name>
                            <description>Capture or compare up event generated an interrupt CCP1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_CCU1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_CCU1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RIS_TOV</name>
                            <description>Trigger overflow</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RIS_TOV_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RIS_TOV_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MIS</name>
                    <description>Masked interrupt status</description>
                    <addressOffset>0x1038</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MIS_Z</name>
                            <description>Zero event generated an interrupt.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_Z_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_Z_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MIS_L</name>
                            <description>Load event generated an interrupt.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_L_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_L_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MIS_CCD0</name>
                            <description>Capture or compare down event generated an interrupt CCP0</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_CCD0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_CCD0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MIS_CCD1</name>
                            <description>Capture or compare down event generated an interrupt CCP1</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_CCD1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_CCD1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MIS_CCU0</name>
                            <description>Capture or compare up event generated an interrupt CCP0</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_CCU0_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_CCU0_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MIS_CCU1</name>
                            <description>Capture or compare up event generated an interrupt CCP1</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_CCU1_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_CCU1_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MIS_TOV</name>
                            <description>Trigger overflow</description>
                            <bitOffset>0x19</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MIS_TOV_CLR</name>
                                    <description>CLR</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MIS_TOV_SET</name>
                                    <description>SET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
