WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL0_LCOND</name>
                                    <description>CCCTL0_LCOND</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL1_LCOND</name>
                                    <description>CCCTL1_LCOND</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL2_LCOND</name>
                                    <description>CCCTL2_LCOND</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_CCCTL3_LCOND</name>
                                    <description>CCCTL3_LCOND</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_QEI_2INP</name>
                                    <description>QEI_2INP</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CLC_QEI_3INP</name>
                                    <description>QEI_3INP</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CAC</name>
                            <description>Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL0_ACOND</name>
                                    <description>CCCTL0_ACOND</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL1_ACOND</name>
                                    <description>CCCTL1_ACOND</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL2_ACOND</name>
                                    <description>CCCTL2_ACOND</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_CCCTL3_ACOND</name>
                                    <description>CCCTL3_ACOND</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_QEI_2INP</name>
                                    <description>QEI_2INP</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CAC_QEI_3INP</name>
                                    <description>QEI_3INP</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTRCTL_CZC</name>
                            <description>Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved.</description>
                            <bitOffset>0xD</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL0_ZCOND</name>
                                    <description>CCCTL0_ZCOND</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL1_ZCOND</name>
                                    <description>CCCTL1_ZCOND</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL2_ZCOND</name>
                                    <description>CCCTL2_ZCOND</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_CCCTL3_ZCOND</name>
                                    <description>CCCTL3_ZCOND</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_QEI_2INP</name>
                                    <description>QEI_2INP</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTRCTL_CZC_QEI_3INP</name>
                                    <description>QEI_3INP</description>
                                    <value>5</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LOAD</name>
                    <description>Load Register</description>
                    <addressOffset>0x1808</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>LOAD_LD</name>
                            <description>Load Value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1</dimArrayIndex>
                    <name>CC_01[%s]</name>
                    <description>Capture or Compare Register 0 to Capture or Compare Register 1</description>
                    <addressOffset>0x1810</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CC_01_CCVAL</name>
                            <description>Capture or compare value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
