WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
            <register>
                    <name>CTL0</name>
                    <description>Control 0</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTL0_IPSEL</name>
                            <description>Channel input selected for the positive terminal of the comparator if IPEN is set to 1.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_0</name>
                                    <description>CH_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_1</name>
                                    <description>CH_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_2</name>
                                    <description>CH_2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_3</name>
                                    <description>CH_3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_4</name>
                                    <description>CH_4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_5</name>
                                    <description>CH_5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_6</name>
                                    <description>CH_6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPSEL_CH_7</name>
                                    <description>CH_7</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL0_IPEN</name>
                            <description>Channel input enable for the positive terminal of the comparator.</description>
                            <bitOffset>0xF</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_IPEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IPEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL0_IMEN</name>
                            <description>Channel input enable for the negative terminal of the comparator.</description>
                            <bitOffset>0x1F</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_IMEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL0_IMSEL</name>
                            <description>Channel input selected for the negative terminal of the comparator if IMEN is set to 1.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_0</name>
                                    <description>CH_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_1</name>
                                    <description>CH_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_2</name>
                                    <description>CH_2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_3</name>
                                    <description>CH_3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_4</name>
                                    <description>CH_4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_5</name>
                                    <description>CH_5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_6</name>
                                    <description>CH_6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_IMSEL_CH_7</name>
                                    <description>CH_7</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL1</name>
                    <description>Control 1</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTL1_ENABLE</name>
                            <description>This bit turns on the comparator. When the comparator is turned off it consumes no power.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_ENABLE_OFF</name>
                                    <description>OFF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_ENABLE_ON</name>
                                    <description>ON</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_MODE</name>
                            <description>This bit selects the comparator operating mode.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_MODE_FAST</name>
                                    <description>FAST</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_MODE_ULP</name>
                                    <description>ULP</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_EXCH</name>
                            <description>This bit exchanges the comparator inputs and inverts the comparator output.</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_EXCH_NO_EXC</name>
                                    <description>NO_EXC</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_EXCH_EXC</name>
                                    <description>EXC</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_SHORT</name>
                            <description>This bit shorts the positive and negative input terminals of the comparator.</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_SHORT_NO_SHT</name>
                                    <description>NO_SHT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_SHORT_SHT</name>
                                    <description>SHT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_IES</name>
                            <description>This bit selected the interrupt edge for COMPIFG and COMPINVIFG.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_IES_RISING</name>
                                    <description>RISING</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_IES_FALLING</name>
                                    <description>FALLING</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_HYST</name>
                            <description>These bits select the hysteresis setting of the comparator.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_HYST_NO_HYS</name>
                                    <description>NO_HYS</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_HYST_LOW_HYS</name>
                                    <description>LOW_HYS</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_HYST_MED_HYS</name>
                                    <description>MED_HYS</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_HYST_HIGH_HYS</name>
                                    <description>HIGH_HYS</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_OUTPOL</name>
                            <description>This bit selects the comparator output polarity.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_OUTPOL_NON_INV</name>
                                    <description>NON_INV</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_OUTPOL_INV</name>
                                    <description>INV</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_FLTEN</name>
                            <description>This bit enables the analog filter at comparator output.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_FLTEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_FLTEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_FLTDLY</name>
                            <description>These bits select the comparator output filter delay. See the device-specific data sheet for specific values on comparator propagation delay for different filter delay settings.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_FLTDLY_DLY_0</name>
                                    <description>DLY_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_FLTDLY_DLY_1</name>
                                    <description>DLY_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_FLTDLY_DLY_2</name>
                                    <description>DLY_2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_FLTDLY_DLY_3</name>
                                    <description>DLY_3</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_WINCOMPEN</name>
                            <description>This bit enables window comparator operation of comparator.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_WINCOMPEN_OFF</name>
                                    <description>OFF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_WINCOMPEN_ON</name>
                                    <description>ON</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
