WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
				<register>
                    <name>GENCLKCFG</name>
                    <description>General clock configuration</description>
                    <addressOffset>0x1138</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000000</resetMask>
                    <fields>
                        <field>
                            <name>GENCLKCFG_EXCLKSRC</name>
                            <description>EXCLKSRC selects the source for the CLK_OUT external clockoutput block. ULPCLK and MFPCLK require the CLK_OUT divider(EXCLKDIVEN) to be enabled</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GENCLKCFG_EXCLKDIVVAL</name>
                            <description>EXCLKDIVVAL selects the divider value for the divider in the CLK_OUT external clock output block.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                        </field>
						<field>
                            <name>GENCLKCFG_EXCLKDIVEN</name>
                            <description>EXCLKDIVEN enables or disables the divider function of the CLK_OUT external clock output block.</description>
                            <bitOffset>0x7</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
						<field>
                            <name>GENCLKCFG_FCCSELCLK</name>
                            <description>FCCSELCLK selectes the frequency clock counter (FCC) clock source</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                        </field>
						<field>
                            <name>GENCLKCFG_FCCTRIGSRC</name>
                            <description>FCCTRIGSRC selects the frequency clock counter (FCC) trigger source</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
						<field>
                            <name>GENCLKCFG_FCCLVLTRIG</name>
                            <description>FCCLVLTRIG selects the frequency clock counter (FCC) trigger mode</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                        </field>
						<field>
                            <name>GENCLKCFG_ANACPUMPCFG</name>
                            <description>ANACPUMPCFG selects the analog mux charge pump (VBOOST) enable method.</description>
                            <bitOffset>0x16</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                        </field>
						<field>
                            <name>GENCLKCFG_FCCTRIGCNT</name>
                            <description>FCCTRIGCNT specifies the number of trigger clock periods in the trigger window. FCCTRIGCNT=0h (one trigger clock period) up to 1Fh (32 trigger clock periods) may be specified.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>GENCLKEN</name>
                    <description>General clock enable control</description>
                    <addressOffset>0x113C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000011</resetMask>
                    <fields>
                        <field>
                            <name>GENCLKEN_EXCLKEN</name>
                            <description>EXCLKEN enables the CLK_OUT external clock output block.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GENCLKEN_EXCLKEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GENCLKEN_EXCLKEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GENCLKEN_MFPCLKEN</name>
                            <description>MFPCLKEN enables the middle frequency precision clock (MFPCLK).</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>GENCLKEN_MFPCLKEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>GENCLKEN_MFPCLKEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PMODECFG</name>
                    <description>Power mode configuration</description>
                    <addressOffset>0x1140</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000023</resetMask>
                    <fields>
                        <field>
                            <name>PMODECFG_SYSSRAMONSTOP</name>
                            <description>SYSSRAMONSTOP selects whether the SRAM controller is enabled or disabled in STOP mode.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PMODECFG_SYSSRAMONSTOP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_SYSSRAMONSTOP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PMODECFG_DSLEEP</name>
                            <description>DSLEEP selects the operating mode to enter upon a DEEPSLEEP request from the CPU.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_STANDBY</name>
                                    <description>STANDBY</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PMODECFG_DSLEEP_SHUTDOWN</name>
                                    <description>SHUTDOWN</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCC</name>
                    <description>Frequency clock counter (FCC) count</description>
                    <addressOffset>0x1150</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffff</resetMask>
                    <fields>
                        <field>
                            <name>FCC_DATA</name>
                            <description>Frequency clock counter (FCC) count value.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x16</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSOSCTRIMUSER</name>
                    <description>SYSOSC user-specified trim</description>
                    <addressOffset>0x1170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x1fff3f73</resetMask>
                    <fields>
                        <field>
                            <name>SYSOSCTRIMUSER_RESCOARSE</name>
                            <description>RESCOARSE specifies the resister coarse trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x6</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_RESFINE</name>
                            <description>RESFINE specifies the resister fine trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_RDIV</name>
                            <description>RDIV specifies the frequency correction loop (FCL) resistor trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x9</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_FREQ</name>
                            <description>FREQ specifies the target user-trimmed frequency for SYSOSC.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSOSCTRIMUSER_FREQ_SYSOSC16M</name>
                                    <description>SYSOSC16M</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSOSCTRIMUSER_FREQ_SYSOSC24M</name>
                                    <description>SYSOSC24M</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSOSCTRIMUSER_CAP</name>
                            <description>CAP specifies the SYSOSC capacitor trim.  This value changes with the target frequency.</description>
                            <bitOffset>0x4</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SRAMBOUNDARY</name>
                    <description>SRAM Write Boundary</description>
                    <addressOffset>0x1178</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000fffe0</resetMask>
                    <fields>
                        <field>
                            <name>SRAMBOUNDARY_ADDR</name>
                            <description>SRAM boundary configuration. The value configured into this acts such that: SRAM accesses to addresses less than or equal value will be RW only. SRAM accesses to addresses greater than value will be RX only. Value of 0 is not valid (system will have no stack). If set to 0, the system acts as if the entire SRAM is RWX.  Any non-zero value can be configured, including a value = SRAM size.</description>
                            <bitOffset>0x5</bitOffset>
                            <bitWidth>0xF</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSTEMCFG</name>
                    <description>System configuration</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SYSTEMCFG_KEY</name>
                            <description>The key value of 1Bh (27) must be written to KEY together with contents to be updated. Reads as 0</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_KEY_VALUE</name>
                                    <description>VALUE</description>
                                    <value>27</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SYSTEMCFG_WWDTLP0RSTDIS</name>
                            <description>WWDTLP0RSTDIS specifies whether a WWDT Error Event will trigger a BOOTRST or an NMI.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_WWDTLP0RSTDIS_FALSE</name>
                                    <description>FALSE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SYSTEMCFG_WWDTLP0RSTDIS_TRUE</name>
                                    <description>TRUE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRITELOCK</name>
                    <description>SYSCTL register write lockout</description>
                    <addressOffset>0x1200</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>WRITELOCK_ACTIVE</name>
                            <description>ACTIVE controls whether critical SYSCTL registers are write protected or not.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>WRITELOCK_ACTIVE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>WRITELOCK_ACTIVE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
