WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <name>CTL0</name>
                    <description>Control Register 0</description>
                    <addressOffset>0x1100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTL0_ENC</name>
                            <description>Enable conversion</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_ENC_OFF</name>
                                    <description>OFF</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_ENC_ON</name>
                                    <description>ON</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL0_PWRDN</name>
                            <description>Power down policy</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_PWRDN_AUTO</name>
                                    <description>AUTO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_PWRDN_MANUAL</name>
                                    <description>MANUAL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL0_SCLKDIV</name>
                            <description>Sample clock divider</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_1</name>
                                    <description>DIV_BY_1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_2</name>
                                    <description>DIV_BY_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_4</name>
                                    <description>DIV_BY_4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_8</name>
                                    <description>DIV_BY_8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_16</name>
                                    <description>DIV_BY_16</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_24</name>
                                    <description>DIV_BY_24</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_32</name>
                                    <description>DIV_BY_32</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL0_SCLKDIV_DIV_BY_48</name>
                                    <description>DIV_BY_48</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTL1</name>
                    <description>Control Register 1</description>
                    <addressOffset>0x1104</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTL1_TRIGSRC</name>
                            <description>Sample trigger source</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_TRIGSRC_SOFTWARE</name>
                                    <description>SOFTWARE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_TRIGSRC_EVENT</name>
                                    <description>EVENT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_SC</name>
                            <description>Start of conversion</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_SC_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_SC_START</name>
                                    <description>START</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_CONSEQ</name>
                            <description>Conversion sequence mode</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_CONSEQ_SINGLE</name>
                                    <description>SINGLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_CONSEQ_SEQUENCE</name>
                                    <description>SEQUENCE</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_CONSEQ_REPEATSINGLE</name>
                                    <description>REPEATSINGLE</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_CONSEQ_REPEATSEQUENCE</name>
                                    <description>REPEATSEQUENCE</description>
                                    <value>3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_SAMPMODE</name>
                            <description>Sample mode. This bit selects the source of the sampling signal. 
MANUAL option is not valid when TRIGSRC is selected as hardware event trigger.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_SAMPMODE_AUTO</name>
                                    <description>AUTO</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_SAMPMODE_MANUAL</name>
                                    <description>MANUAL</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_AVGN</name>
                            <description>Hardware averager numerator. Selects number of conversions to accumulate for current MEMCTLx and then it is divided by AVGD. Result will be stored in MEMRESx.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_2</name>
                                    <description>AVG_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_4</name>
                                    <description>AVG_4</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_8</name>
                                    <description>AVG_8</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_16</name>
                                    <description>AVG_16</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_32</name>
                                    <description>AVG_32</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_64</name>
                                    <description>AVG_64</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGN_AVG_128</name>
                                    <description>AVG_128</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL1_AVGD</name>
                            <description>Hardware averager denominator. The number to divide the accumulated value by (this is a shift). Note result register is maximum of 16-bits long so if not shifted appropirately result will be truncated.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT0</name>
                                    <description>SHIFT0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT1</name>
                                    <description>SHIFT1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT2</name>
                                    <description>SHIFT2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT3</name>
                                    <description>SHIFT3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT4</name>
                                    <description>SHIFT4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT5</name>
                                    <description>SHIFT5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT6</name>
                                    <description>SHIFT6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL1_AVGD_SHIFT7</name>
                                    <description>SHIFT7</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
