WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <name>CTL2</name>
                    <description>Control Register 2</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTL2_DF</name>
                            <description>Data read-back format. Data is always stored in binary unsigned format.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_DF_UNSIGNED</name>
                                    <description>UNSIGNED</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_DF_SIGNED</name>
                                    <description>SIGNED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL2_RES</name>
                            <description>Resolution. These bits define the resolutoin of ADC conversion result.
Note : A value of 3 defaults to 12-bits resolution.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_RES_BIT_12</name>
                                    <description>BIT_12</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_RES_BIT_10</name>
                                    <description>BIT_10</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_RES_BIT_8</name>
                                    <description>BIT_8</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL2_STARTADD</name>
                            <description>Sequencer start address. These bits select which MEMCTLx is used for single conversion or as first MEMCTL for sequence mode. 
The value of STARTADD is 0x00 to 0x17, corresponding to MEMRES0 to MEMRES23.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_00</name>
                                    <description>ADDR_00</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_01</name>
                                    <description>ADDR_01</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_02</name>
                                    <description>ADDR_02</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_03</name>
                                    <description>ADDR_03</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_04</name>
                                    <description>ADDR_04</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_05</name>
                                    <description>ADDR_05</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_06</name>
                                    <description>ADDR_06</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_07</name>
                                    <description>ADDR_07</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_08</name>
                                    <description>ADDR_08</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_09</name>
                                    <description>ADDR_09</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_10</name>
                                    <description>ADDR_10</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_11</name>
                                    <description>ADDR_11</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_12</name>
                                    <description>ADDR_12</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_13</name>
                                    <description>ADDR_13</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_14</name>
                                    <description>ADDR_14</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_15</name>
                                    <description>ADDR_15</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_16</name>
                                    <description>ADDR_16</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_17</name>
                                    <description>ADDR_17</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_18</name>
                                    <description>ADDR_18</description>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_19</name>
                                    <description>ADDR_19</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_20</name>
                                    <description>ADDR_20</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_21</name>
                                    <description>ADDR_21</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_22</name>
                                    <description>ADDR_22</description>
                                    <value>22</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_STARTADD_ADDR_23</name>
                                    <description>ADDR_23</description>
                                    <value>23</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL2_ENDADD</name>
                            <description>Sequence end address. These bits select which MEMCTLx is the last one for the sequence mode.
The value of ENDADD is 0x00 to 0x17, corresponding to MEMRES0 to MEMRES23.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_00</name>
                                    <description>ADDR_00</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_01</name>
                                    <description>ADDR_01</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_02</name>
                                    <description>ADDR_02</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_03</name>
                                    <description>ADDR_03</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_04</name>
                                    <description>ADDR_04</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_05</name>
                                    <description>ADDR_05</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_06</name>
                                    <description>ADDR_06</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_07</name>
                                    <description>ADDR_07</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_08</name>
                                    <description>ADDR_08</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_09</name>
                                    <description>ADDR_09</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_10</name>
                                    <description>ADDR_10</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_11</name>
                                    <description>ADDR_11</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_12</name>
                                    <description>ADDR_12</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_13</name>
                                    <description>ADDR_13</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_14</name>
                                    <description>ADDR_14</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_15</name>
                                    <description>ADDR_15</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_16</name>
                                    <description>ADDR_16</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_17</name>
                                    <description>ADDR_17</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_18</name>
                                    <description>ADDR_18</description>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_19</name>
                                    <description>ADDR_19</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_20</name>
                                    <description>ADDR_20</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_21</name>
                                    <description>ADDR_21</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_22</name>
                                    <description>ADDR_22</description>
                                    <value>22</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_ENDADD_ADDR_23</name>
                                    <description>ADDR_23</description>
                                    <value>23</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL2_DMAEN</name>
                            <description>Enable DMA trigger for data transfer. 
Note: DMAEN bit is cleared by hardware based on DMA done signal at the end of data transfer. Software has to re-enable DMAEN bit for ADC to generate DMA triggers.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_DMAEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_DMAEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL2_SAMPCNT</name>
                            <description>Number of ADC converted samples to be transferred on a DMA trigger</description>
                            <bitOffset>0xB</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_SAMPCNT_MIN</name>
                                    <description>MIN</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_SAMPCNT_MAX</name>
                                    <description>MAX</description>
                                    <value>24</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CTL2_FIFOEN</name>
                            <description>Enable FIFO based operation</description>
                            <bitOffset>0xA</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CTL2_FIFOEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CTL2_FIFOEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
