WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <dim>4</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3</dimArrayIndex>
                    <name>MEMCTL[%s]</name>
                    <description>Conversion Memory Control Register</description>
                    <addressOffset>0x1180</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MEMCTL_CHANSEL</name>
                            <description>Input channel select.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x5</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_0</name>
                                    <description>CHAN_0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_1</name>
                                    <description>CHAN_1</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_2</name>
                                    <description>CHAN_2</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_3</name>
                                    <description>CHAN_3</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_4</name>
                                    <description>CHAN_4</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_5</name>
                                    <description>CHAN_5</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_6</name>
                                    <description>CHAN_6</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_7</name>
                                    <description>CHAN_7</description>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_8</name>
                                    <description>CHAN_8</description>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_9</name>
                                    <description>CHAN_9</description>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_10</name>
                                    <description>CHAN_10</description>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_11</name>
                                    <description>CHAN_11</description>
                                    <value>11</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_12</name>
                                    <description>CHAN_12</description>
                                    <value>12</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_13</name>
                                    <description>CHAN_13</description>
                                    <value>13</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_14</name>
                                    <description>CHAN_14</description>
                                    <value>14</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_15</name>
                                    <description>CHAN_15</description>
                                    <value>15</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_16</name>
                                    <description>CHAN_16</description>
                                    <value>16</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_17</name>
                                    <description>CHAN_17</description>
                                    <value>17</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_18</name>
                                    <description>CHAN_18</description>
                                    <value>18</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_19</name>
                                    <description>CHAN_19</description>
                                    <value>19</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_20</name>
                                    <description>CHAN_20</description>
                                    <value>20</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_21</name>
                                    <description>CHAN_21</description>
                                    <value>21</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_22</name>
                                    <description>CHAN_22</description>
                                    <value>22</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_23</name>
                                    <description>CHAN_23</description>
                                    <value>23</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_24</name>
                                    <description>CHAN_24</description>
                                    <value>24</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_25</name>
                                    <description>CHAN_25</description>
                                    <value>25</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_26</name>
                                    <description>CHAN_26</description>
                                    <value>26</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_27</name>
                                    <description>CHAN_27</description>
                                    <value>27</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_28</name>
                                    <description>CHAN_28</description>
                                    <value>28</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_29</name>
                                    <description>CHAN_29</description>
                                    <value>29</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_30</name>
                                    <description>CHAN_30</description>
                                    <value>30</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_CHANSEL_CHAN_31</name>
                                    <description>CHAN_31</description>
                                    <value>31</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MEMCTL_TRIG</name>
                            <description>Trigger policy. Indicates if a trigger will be needed to step to the next MEMCTL in the sequence or to perform next conversion in the case of repeat single channel conversions.</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_TRIG_AUTO_NEXT</name>
                                    <description>AUTO_NEXT</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_TRIG_TRIGGER_NEXT</name>
                                    <description>TRIGGER_NEXT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MEMCTL_VRSEL</name>
                            <description>Voltage reference selection. VEREFM must be connected to on-board ground when external reference option is selected.
Note: Writing value 0x3 defaults to INTREF.</description>
                            <bitOffset>0x8</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_VRSEL_VDDA</name>
                                    <description>VDDA</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_VRSEL_EXTREF</name>
                                    <description>EXTREF</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_VRSEL_INTREF</name>
                                    <description>INTREF</description>
                                    <value>2</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MEMCTL_WINCOMP</name>
                            <description>Enable window comparator.</description>
                            <bitOffset>0x1C</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_WINCOMP_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_WINCOMP_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MEMCTL_BCSEN</name>
                            <description>Enable burn out current source.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_BCSEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_BCSEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MEMCTL_AVGEN</name>
                            <description>Enable hardware averaging.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_AVGEN_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_AVGEN_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MEMCTL_STIME</name>
                            <description>Selects the source of sample timer period between SCOMP0 and SCOMP1.</description>
                            <bitOffset>0xC</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>MEMCTL_STIME_SEL_SCOMP0</name>
                                    <description>SEL_SCOMP0</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>MEMCTL_STIME_SEL_SCOMP1</name>
                                    <description>SEL_SCOMP1</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STATUS</name>
                    <description>Status Register</description>
                    <addressOffset>0x1340</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STATUS_BUSY</name>
                            <description>Busy. This bit indicates that an active ADC sample or conversion operation is in progress.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATUS_BUSY_IDLE</name>
                                    <description>IDLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATUS_BUSY_ACTIVE</name>
                                    <description>ACTIVE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STATUS_REFBUFRDY</name>
                            <description>Indicates reference buffer is powered up and ready.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STATUS_REFBUFRDY_NOTREADY</name>
                                    <description>NOTREADY</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STATUS_REFBUFRDY_READY</name>
                                    <description>READY</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>
        <peripheral>
            <name>ADC0_SVT</name>
            <version>1.0</version>
            <description>PERIPHERALREGIONSVT</description>
            <baseAddress>0x4055A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers><register>
                    <name>FIFODATA</name>
                    <description>FIFO Data Register</description>
                    <addressOffset>0x160</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>FIFODATA_DATA</name>
                            <description>Read from this data field returns the ADC sample from FIFO.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>4</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3</dimArrayIndex>
                    <name>MEMRES[%s]</name>
                    <description>Memory Result Register</description>
                    <addressOffset>0x280</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>MEMRES_DATA</name>
                            <description>MEMRES result register.
If DF = 0, unsigned binary:
The conversion results are right aligned. In 10 and 8 bit modes, the unused MSB bits are forced to 0. 
If DF = 1, 2s-complement format:
The conversion results are left aligned. In 10 and 8 bit modes, the unused LSB bits are forced to 0.
The data is stored in the right-justified format and is converted to the left-justified 2s-complement format during read back.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>
        <peripheral>
            <name>WUC</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40424000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x500</size>
                <usage>registers</usage>
            </addressBlock>
            <registers><register>
                    <name>FSUB_0</name>
                    <description>Subscriber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
