WKNick/MSPM0L1306-BASIC-RUST-CONFIG/.vscode/MSPM0L130X.svd
                <register>
                    <name>FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            </registers></peripheral>
        <peripheral>
            <name>TIMG0</name>
            <version>1.0</version>
            <description>PERIPHERALREGION</description>
            <baseAddress>0x40084000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1F00</size>
                <usage>registers</usage>
            </addressBlock>
            <registers><register>
                    <name>FSUB_0</name>
                    <description>Subsciber Port 0</description>
                    <addressOffset>0x400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FSUB_1</name>
                    <description>Subscriber Port 1</description>
                    <addressOffset>0x404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FSUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUB_0</name>
                    <description>Publisher Port 0</description>
                    <addressOffset>0x444</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPUB_0_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FPUB_0_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FPUB_1</name>
                    <description>Publisher Port 1</description>
                    <addressOffset>0x448</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FPUB_1_CHANID</name>
                            <description>0 = disconnected.
1-15 = connected to channelID = CHANID.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FPUB_1_CHANID_UNCONNECTED</name>
                                    <description>UNCONNECTED</description>
                                    <value>0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            <register>
                    <name>PWREN</name>
                    <description>Power enable</description>
                    <addressOffset>0x800</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWREN_ENABLE</name>
                            <description>Enable the power</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWREN_ENABLE_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PWREN_ENABLE_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PWREN_KEY</name>
                            <description>KEY to allow Power State Change</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PWREN_KEY_UNLOCK_W</name>
                                    <description>_TO_UNLOCK_W_</description>
                                    <value>38</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTCTL</name>
                    <description>Reset Control</description>
                    <addressOffset>0x804</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RSTCTL_RESETSTKYCLR</name>
                            <description>Clear the RESETSTKY bit in the STAT register</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETSTKYCLR_NOP</name>
                                    <description>NOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETSTKYCLR_CLR</name>
                                    <description>CLR</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_RESETASSERT</name>
                            <description>Assert reset to the peripheral</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETASSERT_NOP</name>
                                    <description>NOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>RSTCTL_RESETASSERT_ASSERT</name>
                                    <description>ASSERT</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RSTCTL_KEY</name>
                            <description>Unlock key</description>
                            <bitOffset>0x18</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RSTCTL_KEY_UNLOCK_W</name>
                                    <description>_TO_UNLOCK_W_</description>
                                    <value>177</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STAT</name>
                    <description>Status Register</description>
                    <addressOffset>0x814</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>STAT_RESETSTKY</name>
                            <description>This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_NORES</name>
                                    <description>NORES</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>STAT_RESETSTKY_RESET</name>
                                    <description>RESET</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
            <register>
                    <name>CLKDIV</name>
                    <description>Clock Divider</description>
                    <addressOffset>0x1000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKDIV_RATIO</name>
                            <description>Selects divide ratio of module clock</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_1</name>
                                    <description>DIV_BY_1</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_2</name>
                                    <description>DIV_BY_2</description>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_3</name>
                                    <description>DIV_BY_3</description>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_4</name>
                                    <description>DIV_BY_4</description>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_5</name>
                                    <description>DIV_BY_5</description>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_6</name>
                                    <description>DIV_BY_6</description>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_7</name>
                                    <description>DIV_BY_7</description>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKDIV_RATIO_DIV_BY_8</name>
                                    <description>DIV_BY_8</description>
                                    <value>7</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKSEL</name>
                    <description>Clock Select for Ultra Low Power peripherals</description>
                    <addressOffset>0x1008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CLKSEL_LFCLK_SEL</name>
                            <description>Selects LFCLK as clock source if enabled</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_LFCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_LFCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL_MFCLK_SEL</name>
                            <description>Selects MFCLK as clock source if enabled</description>
                            <bitOffset>0x2</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_MFCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_MFCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLKSEL_BUSCLK_SEL</name>
                            <description>Selects BUSCLK as clock source if enabled</description>
                            <bitOffset>0x3</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CLKSEL_BUSCLK_SEL_DISABLE</name>
                                    <description>DISABLE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CLKSEL_BUSCLK_SEL_ENABLE</name>
                                    <description>ENABLE</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PDBGCTL</name>
                    <description>Peripheral Debug Control</description>
                    <addressOffset>0x1018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PDBGCTL_FREE</name>
                            <description>Free run control</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_STOP</name>
                                    <description>STOP</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_FREE_RUN</name>
                                    <description>RUN</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PDBGCTL_SOFT</name>
                            <description>Soft halt boundary control. This function is only available, if [FREE] is set to 'STOP'</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>PDBGCTL_SOFT_IMMEDIATE</name>
                                    <description>IMMEDIATE</description>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PDBGCTL_SOFT_DELAYED</name>
                                    <description>DELAYED</description>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
